strvsn/ulsa-evo-esp32-firmware/src/stm32_update/stm32_update_manager.cpp
/**
 * @file stm32_update_manager.cpp
 * @brief STM32 update scratch package manager
 */

#include "stm32_update/stm32_update_manager.h"

#include "stm32_update/stm32_bootloader_writer.h"
#include "stm32_update/stm32_secure_bootloader_writer.h"
#include "stm32_update/stm32_target_identity.h"
#include "stm32_update/stm32_package_keys.h"
#include "stm32_update/stm32_package_stream.h"
#include "stm32_update/stm32_version_identity.h"
#include "sensor/ulsa_evo_i2c_client.h"

#include <Preferences.h>
#include <ctype.h>
#include <esp_system.h>
#include <string.h>

namespace stm32_update {
namespace {

static const char STM32_PACKAGE_PARTITION_LABEL[] = "stm32pkg";
static const esp_partition_subtype_t STM32_PACKAGE_PARTITION_SUBTYPE =
  (esp_partition_subtype_t)0x40;
static const char STM32_UPDATE_NVS_NAMESPACE[] = "stm32upd";
static const char STM32_UPDATE_NVS_ANTI_ROLLBACK_KEY[] = "ar_floor";
static const char STM32_UPDATE_NVS_WRITE_STAGE_KEY[] = "wr_stage";
static const char STM32_UPDATE_NVS_WRITE_SHA_KEY[] = "wr_sha";
static const char STM32_UPDATE_NVS_BOOT_COUNT_KEY[] = "boot_count";
static const uint32_t STM32_WRITE_STACK_MIN_FREE_BYTES = 4096;

void appendJsonString(String& json, const char* value) {
  json += '"';
  for (const char* p = value; p != nullptr && *p != '\0'; ++p) {
    switch (*p) {
      case '\\':
      case '"':
        json += '\\';
        json += *p;
        break;
      case '\n':
        json += "\\n";
        break;
      case '\r':
        json += "\\r";
        break;
      default:
        json += *p;
        break;
    }
  }
  json += '"';
}

const char* errorCodeForMessage(const char* error) {
  if (error == nullptr || error[0] == '\0') return nullptr;
  if (strcmp(error, "stm32pkg partition not found") == 0) return "scratch_partition_missing";
  if (strcmp(error, "STM32 update is busy") == 0) return "busy";
  if (strcmp(error, "STM32 package exceeds scratch partition") == 0) return "scratch_overflow";
  if (strcmp(error, "Failed to erase stm32pkg partition") == 0) return "scratch_erase_failed";
  if (strcmp(error, "STM32 package upload is not active") == 0) return "upload_inactive";
  if (strcmp(error, "Failed to write stm32pkg partition") == 0) return "scratch_write_failed";
  if (strcmp(error, "STM32 package upload did not start") == 0) return "upload_not_started";
  if (strcmp(error, "STM32 package is empty") == 0) return "package_empty";
  if (strcmp(error, "STM32 package is not ready for verification") == 0) return "package_not_ready";
  if (strcmp(error, "STM32 writer unavailable") == 0) return "writer_unavailable";
  if (strcmp(error, "STM32 package is not ready to write") == 0) return "package_not_ready";
  if (strcmp(error, "STM32 write already running") == 0) return "write_already_running";
  if (strcmp(error, "STM32 reserved package changed") == 0) return "reserved_package_changed";
  if (strcmp(error, "Failed to start STM32 write task") == 0) return "write_task_start_failed";
  if (strcmp(error, "STM32 recovery marker write failed") == 0) return "recovery_marker_write_failed";
  if (strcmp(error, "STM32 writer stack headroom too low") == 0) return "writer_stack_low";
  if (strcmp(error, "STM32 restart left update state unknown") == 0) return "restart_unknown";
  if (strcmp(error, "STM32 package is not writable") == 0) return "package_not_writable";
  if (strcmp(error, "STM32 package encoding unsupported") == 0) return "package_encoding_unsupported";
  if (strcmp(error, "stm32_revision_rollback") == 0) return "revision_rollback";
  if (strcmp(error, "STM32 write failed") == 0) return "write_failed";
  if (strcmp(error, "target_chip_id_mismatch") == 0) return "target_chip_id_mismatch";
  if (strcmp(error, "bootloader_info_invalid") == 0) return "bootloader_info_invalid";
  if (strcmp(error, "Invalid OTA token") == 0) return "invalid_token";
  if (strcmp(error, "Wrong portal purpose") == 0) return "wrong_portal_purpose";
  if (strcmp(error, "Invalid STM32 package sha256 header") == 0) return "invalid_package_sha256_header";
  if (strcmp(error, "Failed to start STM32 package sha256") == 0) return "package_sha256_start_failed";
  if (strcmp(error, "Failed to update STM32 package sha256") == 0) return "package_sha256_update_failed";
  if (strcmp(error, "Failed to finish STM32 package sha256") == 0) return "package_sha256_finish_failed";
  if (strcmp(error, "Failed to read stored STM32 package for sha256") == 0) return "stored_package_sha256_read_failed";
  if (strcmp(error, "STM32 package sha256 mismatch") == 0) return "package_sha256_mismatch";
  if (strcmp(error, "STM32 package does not match update session") == 0) return "package_session_mismatch";
  if (strcmp(error, "post_write_version_mismatch") == 0) return "post_write_version_mismatch";
  if (strcmp(error, "post_write_version_unconfirmed") == 0) return "post_write_version_unconfirmed";
  if (strcmp(error, "scratch_cleanup_failed") == 0) return "scratch_cleanup_failed";
  return error;
}

bool isHexSha256String(const char* value) {
  if (value == nullptr || value[0] == '\0') return true;
  for (size_t i = 0; i < STM32_PACKAGE_SHA256_SIZE * 2; ++i) {
    if (value[i] == '\0' || !isxdigit((unsigned char)value[i])) {
      return false;
    }
  }
  return value[STM32_PACKAGE_SHA256_SIZE * 2] == '\0';
}

uint8_t parseHexNibble(char c) {
  if (c >= '0' && c <= '9') return (uint8_t)(c - '0');
  if (c >= 'a' && c <= 'f') return (uint8_t)(c - 'a' + 10);
  if (c >= 'A' && c <= 'F') return (uint8_t)(c - 'A' + 10);
  return 0;
}

bool digestMatchesHex(const uint8_t digest[STM32_PACKAGE_SHA256_SIZE], const char* hex) {
  if (!isHexSha256String(hex) || hex == nullptr || hex[0] == '\0') {
    return false;
  }
  uint8_t mismatch = 0;
  for (size_t i = 0; i < STM32_PACKAGE_SHA256_SIZE; ++i) {
    const uint8_t expected = (uint8_t)((parseHexNibble(hex[i * 2]) << 4) |
                                      parseHexNibble(hex[i * 2 + 1]));
    mismatch |= (uint8_t)(digest[i] ^ expected);
  }
  return mismatch == 0;
}

struct PackageVerifyProgressRelay {
  Stm32UpdateProgressCallback callback;
};

void relayPackageVerifyProgress(size_t verifiedBytes,
                                size_t totalBytes,
                                void* context) {
  PackageVerifyProgressRelay* relay =
    static_cast<PackageVerifyProgressRelay*>(context);
  if (relay == nullptr || relay->callback == nullptr) {
    return;
  }
  const uint32_t progress = totalBytes == 0
    ? 0U
    : static_cast<uint32_t>((verifiedBytes * 100UL) / totalBytes);
  relay->callback(static_cast<uint8_t>(progress > 100U ? 100U : progress));
}

}  // namespace

Stm32UpdateManager::Stm32UpdateManager()
  : _partition(nullptr)
  , _phase(UpdatePhase::Idle)
  , _scratchBytes(0)
  , _totalBytesHint(0)
  , _writtenBytes(0)
  , _verifiedBytes(0)
  , _packageVerifiedBytes(0)
  , _packageFileBytes(0)
  , _packagePayloadBytes(0)
  , _packageFirmwareBytes(0)
  , _packageChunkTableOffset(0)
  , _packagePayloadOffset(0)
  , _packageSha256{}
  , _antiRollbackFloor(0)
  , _currentFirmwareVersionRaw(0)
  , _currentFirmwareRevisionRaw(0)
  , _currentFirmwareVersionFloor(0)
  , _espResetReason(0)
  , _espBootCount(0)
  , _writeTaskStackMinFreeBytes(UINT32_MAX)
  , _postWriteVersionCheckAttempts(0)
  , _hasVerifiedPackage(false)
  , _hasExpectedPackageSha256(false)
  , _hasCurrentFirmwareVersion(false)
  , _postWriteVersionCheckComplete(false)
  , _postWriteVersionRead(false)
  , _postWriteVersionMatchesPackage(false)
  , _antiRollbackStoreReady(false)
  , _uploadSha256Active(false)
  , _hasBootloaderSyncResult(false)
  , _lastBootloaderSyncOk(false)
  , _lastBootloaderSyncAttempts(0)
  , _lastBootloaderSyncResponse(0)
  , _bootloaderSessionActive(false)
  , _writeEraseStarted(false)
  , _writeStartPending(false)
  , _recoveryRestartUnknown(false)
  , _recoveryStage(WriteRecoveryStage::None)
  , _writeTaskHandle(nullptr)
  , _writeBootloader(nullptr)
  , _writeSerial(nullptr)
  , _i2cClient(nullptr)
  , _secureFrameBuffer{} {
  memset(_lastError, 0, sizeof(_lastError));
  memset(_lastBootloaderSyncError, 0, sizeof(_lastBootloaderSyncError));
  memset(_expectedPackageSha256Hex, 0, sizeof(_expectedPackageSha256Hex));
  mbedtls_sha256_init(&_uploadSha256);
}

void Stm32UpdateManager::setI2cClient(UlsaEvoI2cClient* client) {
  _i2cClient = client;
  _hasCurrentFirmwareVersion = false;
  _currentFirmwareVersionRaw = 0;
  _currentFirmwareRevisionRaw = 0;
  _currentFirmwareVersionFloor = 0;
}

void Stm32UpdateManager::begin() {
  captureEspBootDiagnostics();
  _partition = esp_partition_find_first(
    ESP_PARTITION_TYPE_DATA,
    STM32_PACKAGE_PARTITION_SUBTYPE,
    STM32_PACKAGE_PARTITION_LABEL);
  if (_partition == nullptr) {
    setError("stm32pkg partition not found");
    _phase = UpdatePhase::Error;
    return;
  }
  // Highest-seen revision is enforced before entering the destructive loader.
  // The same revision remains retryable; intentional old-code recovery must be
  // repackaged with a newer FWREV.
  loadAntiRollbackFloor();
  _phase = UpdatePhase::Idle;
  _writeStartPending = false;
  _recoveryRestartUnknown = false;
  _recoveryStage = WriteRecoveryStage::None;
  clearError();
  clearVerifiedPackage();
  clearBootloaderSyncResult();
  resetUploadHashState();
  resetPostWriteVersionCheck();
  refreshCurrentFirmwareVersionFloor();
  restoreStoredPackageIfPresent();
}

