strvsn/ulsa-evo-esp32-firmware/src/stm32_update/stm32_update_manager.cpp
void Stm32UpdateManager::resetCompletedResultForNewSession() {
  if (!shouldResetCompletedResultForNewSession(
        _phase, isWriteInProgress() || _writeStartPending)) {
    return;
  }
  // Successful completion already erased scratch and committed the revision.
  // Reset only its in-memory result, never a recovery package or any Flash/NVS.
  _scratchBytes = 0;
  _totalBytesHint = 0;
  _writtenBytes = 0;
  _verifiedBytes = 0;
  clearVerifiedPackage();
  clearBootloaderSyncResult();
  resetUploadHashState();
  resetPostWriteVersionCheck();
  clearError();
  _phase = UpdatePhase::Idle;
}

bool Stm32UpdateManager::isAvailable() const {
  return _partition != nullptr;
}

bool Stm32UpdateManager::isBusy() const {
  return updatePhaseIsBusy(_phase);
}

bool Stm32UpdateManager::canCancel() const {
  return _phase == UpdatePhase::Receiving ||
         _phase == UpdatePhase::PackageStored ||
         _phase == UpdatePhase::ReadyToWrite ||
         _phase == UpdatePhase::Error;
}

bool Stm32UpdateManager::canWrite() const {
  if (!_hasVerifiedPackage || _scratchBytes == 0 || _bootloaderSessionActive || _writeTaskHandle != nullptr) {
    return false;
  }
  return _phase == UpdatePhase::ReadyToWrite ||
         _phase == UpdatePhase::RecoveryRequired;
}

bool Stm32UpdateManager::beginPackageUpload(size_t totalBytesHint,
                                            const char* expectedPackageSha256Hex) {
  if (_partition == nullptr) {
    abortPackageUpload("stm32pkg partition not found");
    return false;
  }
  // A second HTTP upload must never tear down a receiving/verifying/write
  // operation that already owns the manager. The request handler reports 409
  // without changing this state.
  if (!mayStartPackageUpload(
        _phase, _bootloaderSessionActive, _writeTaskHandle != nullptr)) {
    return false;
  }
  // WebServer::clientContentLength() describes the complete multipart HTTP
  // body, including boundaries and part headers. Keep it only as a progress
  // hint; the actual package-byte limit is enforced for every upload chunk.
  if (!isHexSha256String(expectedPackageSha256Hex)) {
    setError("Invalid STM32 package sha256 header");
    return false;
  }

  const esp_err_t eraseResult = esp_partition_erase_range(_partition, 0, _partition->size);
  if (eraseResult != ESP_OK) {
    abortPackageUpload("Failed to erase stm32pkg partition");
    return false;
  }

  // The old package can no longer be recovered after this exact-partition
  // erase. Clear any same-hash write marker before accepting replacement data.
  if (!saveWriteRecoveryMarker(WriteRecoveryStage::None)) {
    _scratchBytes = 0;
    _totalBytesHint = 0;
    clearVerifiedPackage();
    setError("STM32 recovery marker write failed");
    _phase = UpdatePhase::Error;
    return false;
  }

  clearError();
  clearVerifiedPackage();
  clearBootloaderSyncResult();
  resetPostWriteVersionCheck();
  resetUploadHashState();
  _hasExpectedPackageSha256 =
    expectedPackageSha256Hex != nullptr && expectedPackageSha256Hex[0] != '\0';
  if (_hasExpectedPackageSha256) {
    strncpy(_expectedPackageSha256Hex,
            expectedPackageSha256Hex,
            sizeof(_expectedPackageSha256Hex) - 1);
  }
  if (!startUploadHash()) {
    abortPackageUpload("Failed to start STM32 package sha256");
    return false;
  }
  _phase = UpdatePhase::Receiving;
  _scratchBytes = 0;
  _totalBytesHint = totalBytesHint;
  _writtenBytes = 0;
  _verifiedBytes = 0;
  _packageVerifiedBytes = 0;
  _packagePayloadBytes = 0;
  _packageFirmwareBytes = 0;
  _packageChunkTableOffset = 0;
  _packagePayloadOffset = 0;
  return true;
}

bool Stm32UpdateManager::writePackageChunk(const uint8_t* data, size_t length) {
  if (_partition == nullptr || _phase != UpdatePhase::Receiving) {
    if (isWriteInProgress()) {
      return false;
    }
    abortPackageUpload("STM32 package upload is not active");
    return false;
  }
  if (data == nullptr || length == 0) {
    return true;
  }
  if (!packageUploadChunkFits(
        _scratchBytes,
        length,
        _partition->size,
        STM32_PACKAGE_MAX_PACKAGE_SIZE)) {
    abortPackageUpload("STM32 package exceeds scratch partition");
    return false;
  }

  const esp_err_t writeResult = esp_partition_write(_partition, _scratchBytes, data, length);
  if (writeResult != ESP_OK) {
    abortPackageUpload("Failed to write stm32pkg partition");
    return false;
  }
  if (_uploadSha256Active && mbedtls_sha256_update_ret(&_uploadSha256, data, length) != 0) {
    abortPackageUpload("Failed to update STM32 package sha256");
    return false;
  }
  _scratchBytes += length;
  return true;
}

bool Stm32UpdateManager::finishPackageUpload(
    Stm32UpdateProgressCallback progressCallback) {
  if (_phase != UpdatePhase::Receiving) {
    if (isWriteInProgress()) {
      return false;
    }
    abortPackageUpload("STM32 package upload did not start");
    return false;
  }
  if (_scratchBytes == 0) {
    abortPackageUpload("STM32 package is empty");
    return false;
  }
  if (!packageUploadSizeFits(
        _scratchBytes,
        _partition->size,
        STM32_PACKAGE_MAX_PACKAGE_SIZE)) {
    abortPackageUpload("STM32 package exceeds scratch partition");
    return false;
  }
  if (!finishUploadHash()) {
    return false;
  }

  _phase = UpdatePhase::PackageStored;
  _writtenBytes = 0;
  _verifiedBytes = 0;
  _packageVerifiedBytes = 0;
  return verifyStoredPackage(false, progressCallback);
}

bool Stm32UpdateManager::verifyStoredPackage(
    bool recoveryRestore,
    Stm32UpdateProgressCallback progressCallback) {
  (void)recoveryRestore;
  if (_partition == nullptr) {
    abortPackageUpload("stm32pkg partition not found");
    return false;
  }
  if (_scratchBytes == 0) {
    abortPackageUpload("STM32 package is empty");
    return false;
  }
  if (_phase != UpdatePhase::PackageStored && _phase != UpdatePhase::Error) {
    abortPackageUpload("STM32 package is not ready for verification");
    return false;
  }

  clearError();
  clearVerifiedPackage();
  clearBootloaderSyncResult();
  refreshCurrentFirmwareVersionFloor();
  _phase = UpdatePhase::Verifying;
  _verifiedBytes = 0;
  _packageVerifiedBytes = 0;

  PackageVerifyOptions options;
  // F411/F446 are both accepted by the signed manifest parser. The ROM
  // bootloader GET ID result is bound to the manifest immediately before erase.
  options.expectedTarget = nullptr;
  options.signaturePublicKey = STM32_PACKAGE_SIGNATURE_PUBLIC_KEY;
  options.signaturePublicKeyLength = STM32_PACKAGE_ED25519_PUBLIC_KEY_SIZE;
  options.expectedSignatureKeyId = STM32_PACKAGE_EXPECTED_SIGNATURE_KEY_ID;
  options.allowRdp1 = false;

  PackageStreamVerifyResult result;
  PackageVerifyProgressRelay progressRelay = {progressCallback};
  const PackageError error = verifyPackageFromPartition(
    _partition,
    _scratchBytes,
    options,
    result,
    progressCallback == nullptr ? nullptr : relayPackageVerifyProgress,
    &progressRelay);
  if (error != PackageError::Ok) {
    setError(packageErrorToString(error));
    _phase = UpdatePhase::Error;
    _verifiedBytes = 0;
    _packageVerifiedBytes = 0;
    if (progressCallback != nullptr) progressCallback(0);
    return false;
  }

  const uint32_t revisionFloor = getEffectiveAntiRollbackFloor();
  if (result.manifest.revision < revisionFloor) {
    setError("stm32_revision_rollback");
    _phase = UpdatePhase::Error;
    _verifiedBytes = 0;
    _packageVerifiedBytes = 0;
    if (progressCallback != nullptr) progressCallback(0);
    return false;
  }

  _verifiedManifest = result.manifest;
  _packageFileBytes = _scratchBytes;
  _packagePayloadBytes = result.payloadLength;
  _packageFirmwareBytes = result.manifest.size;
  _packageChunkTableOffset = STM32_PACKAGE_HEADER_SIZE + result.header.manifestLength;
  _packagePayloadOffset = _packageChunkTableOffset + result.header.chunkTableLength;
  _hasVerifiedPackage = true;
  _phase = UpdatePhase::ReadyToWrite;
  _packageVerifiedBytes = _scratchBytes;
  // Package authentication is not STM32 flash verification. Keep firmware
  // verification at zero until the writer confirms device bytes.
  _verifiedBytes = 0;
  if (progressCallback != nullptr) progressCallback(100);
  return true;
}

bool Stm32UpdateManager::probeBootloaderSync(STM32Bootloader* bootloader,
                                             HardwareSerial* serial) {
  clearBootloaderSyncResult();
  if (!canWrite()) {
    _hasBootloaderSyncResult = true;
    setBootloaderSyncError("package_not_ready");
    return false;
  }

