strvsn/ulsa-evo-esp32-firmware/src/stm32_update/stm32_update_manager.cpp
  if (_verifiedManifest.isV3) {
    Stm32SecureBootloaderWriter secureWriter;
    SecureLoaderStatus status;
    const SecureLoaderError secureError = secureWriter.beginSession(bootloader, serial, status);
    _hasBootloaderSyncResult = true;
    _lastBootloaderSyncAttempts = 1;
    _lastBootloaderSyncResponse = 0;
    _lastBootloaderSyncOk = secureError == SecureLoaderError::Ok;
    if (_lastBootloaderSyncOk) {
      uint16_t expectedChipId = 0;
      _lastBootloaderSyncOk = expectedChipIdForStm32Target(
        _verifiedManifest.target.c_str(), expectedChipId) && status.deviceId == expectedChipId;
    }
    secureWriter.endSession(true);
    if (_lastBootloaderSyncOk) return true;
    setBootloaderSyncError(
      secureError == SecureLoaderError::Ok
        ? "secure_target_chip_id_mismatch"
        : Stm32SecureBootloaderWriter::errorToString(secureError));
    return false;
  }

  Stm32BootloaderWriter writer;
  const BootloaderSyncResult result = writer.probeSync(bootloader, serial);
  _hasBootloaderSyncResult = true;
  _lastBootloaderSyncAttempts = result.attempts;
  _lastBootloaderSyncResponse = result.lastResponse;
  _lastBootloaderSyncOk = result.error == BootloaderSyncError::Ok;

  if (_lastBootloaderSyncOk) {
    return true;
  }

  setBootloaderSyncError(Stm32BootloaderWriter::errorToString(result.error));
  return false;
}

bool Stm32UpdateManager::commitVerifiedAntiRollback() {
  if (!_hasVerifiedPackage) {
    return false;
  }
  return commitAntiRollback(_verifiedManifest.antiRollback);
}

bool Stm32UpdateManager::commitAntiRollback(uint32_t antiRollback) {
  if (antiRollback <= _antiRollbackFloor) {
    return true;
  }
  return saveAntiRollbackFloor(antiRollback);
}

void Stm32UpdateManager::abortPackageUpload(const char* error) {
  // Only the request that owns an upload may reset upload state. In
  // particular, malformed/authentication-failed HTTP requests cannot clear an
  // immutable context while the background writer is programming STM32.
  if (isWriteInProgress()) {
    return;
  }
  setError(error);
  _phase = UpdatePhase::Error;
  _writtenBytes = 0;
  _verifiedBytes = 0;
  _packagePayloadBytes = 0;
  _packageFirmwareBytes = 0;
  clearVerifiedPackage();
  clearBootloaderSyncResult();
  resetUploadHashState();
}

bool Stm32UpdateManager::cancel() {
  if (!canCancel()) {
    return false;
  }
  return discardScratchBeforeWrite();
}

bool Stm32UpdateManager::shouldDiscardScratchOnPortalStop() const {
  return updatePhaseShouldDiscardScratchOnPortalStop(_phase);
}

bool Stm32UpdateManager::discardScratchBeforeWrite() {
  if (!updatePhaseShouldDiscardScratchOnPortalStop(_phase)) {
    return false;
  }
  if (_partition == nullptr) {
    setError("stm32pkg partition not found");
    _phase = UpdatePhase::Error;
    return false;
  }
  if (esp_partition_erase_range(_partition, 0, _partition->size) != ESP_OK) {
    setError("Failed to erase stm32pkg partition");
    _phase = UpdatePhase::Error;
    return false;
  }

  _phase = UpdatePhase::Idle;
  _scratchBytes = 0;
  _totalBytesHint = 0;
  _writtenBytes = 0;
  _verifiedBytes = 0;
  _packagePayloadBytes = 0;
  _packageFirmwareBytes = 0;
  clearVerifiedPackage();
  clearBootloaderSyncResult();
  resetUploadHashState();
  if (!saveWriteRecoveryMarker(WriteRecoveryStage::None)) {
    setError("STM32 recovery marker write failed");
    _phase = UpdatePhase::Error;
    return false;
  }
  clearError();
  return true;
}

const char* Stm32UpdateManager::getLastError() const {
  return _lastError;
}

bool Stm32UpdateManager::isBootloaderSessionActive() const {
  return _bootloaderSessionActive;
}

bool Stm32UpdateManager::verifiedPackageMatches(const char* expectedTarget,
                                                const char* expectedReleaseTag) const {
  if (!_hasVerifiedPackage) {
    return false;
  }
  if (expectedTarget != nullptr && expectedTarget[0] != '\0' &&
      _verifiedManifest.target != expectedTarget) {
    return false;
  }
  if (expectedReleaseTag != nullptr && expectedReleaseTag[0] != '\0' &&
      _verifiedManifest.releaseTag != expectedReleaseTag) {
    return false;
  }
  return true;
}

String Stm32UpdateManager::buildStatusJson(uint8_t nodeId) const {
  const size_t firmwareVerifiedBytes = boundedFirmwareVerifiedBytes(
    _verifiedBytes, _packageFirmwareBytes);
  uint32_t progress = 0;
  if (_phase == UpdatePhase::Receiving && _totalBytesHint > 0) {
    progress = (uint32_t)((_scratchBytes * 100UL) / _totalBytesHint);
  } else if (_phase == UpdatePhase::Verifying && _scratchBytes > 0) {
    progress = updateProgressPercent(_packageVerifiedBytes, _scratchBytes);
  } else if (_phase == UpdatePhase::Writing && _packageFirmwareBytes > 0) {
    progress = updateProgressPercent(_writtenBytes, _packageFirmwareBytes);
  } else if (_phase == UpdatePhase::VerifyingFlash && _packageFirmwareBytes > 0) {
    progress = updateProgressPercent(firmwareVerifiedBytes, _packageFirmwareBytes);
  } else if (_phase == UpdatePhase::PackageStored || _phase == UpdatePhase::ReadyToWrite) {
    progress = 100;
  } else if (_phase == UpdatePhase::Restarting || _phase == UpdatePhase::Complete) {
    progress = 100;
  }

  String json;
  json.reserve(1024);
  json += "{\"phase\":";
  appendJsonString(json, getPhaseString());
  json += ",\"packageReady\":";
  json += (_hasVerifiedPackage && _scratchBytes > 0) ? "true" : "false";
  json += ",\"packageSha256\":";
  if (updateStatusIncludesPackageSha256(
        _hasVerifiedPackage && _scratchBytes > 0)) {
    char packageSha256Hex[STM32_PACKAGE_SHA256_SIZE * 2U + 1U];
    if (formatLowerHex(
          _packageSha256,
          sizeof(_packageSha256),
          packageSha256Hex,
          sizeof(packageSha256Hex))) {
      appendJsonString(json, packageSha256Hex);
    } else {
      json += "null";
    }
  } else {
    json += "null";
  }
  json += ",\"canCancel\":";
  json += canCancel() ? "true" : "false";
  json += ",\"canWrite\":";
  json += canWrite() ? "true" : "false";
  json += ",\"scratchBytes\":";
  json += String((uint32_t)_scratchBytes);
  json += ",\"totalBytes\":";
  json += String((uint32_t)updateStatusTotalBytes(
    _phase,
    _packageFileBytes > 0 ? _packageFileBytes : _totalBytesHint,
    _packageFirmwareBytes));
  json += ",\"packageBytes\":";
  json += String((uint32_t)_packageFileBytes);
  json += ",\"writtenBytes\":";
  json += String((uint32_t)_writtenBytes);
  json += ",\"packageVerifiedBytes\":";
  json += String((uint32_t)_packageVerifiedBytes);
  json += ",\"verifiedBytes\":";
  json += String((uint32_t)firmwareVerifiedBytes);
  json += ",\"progress\":";
  json += String(progress > 100 ? 100 : progress);
  json += ",\"nodeId\":";
  json += String(nodeId);
  json += ",\"target\":";
  if (_hasVerifiedPackage) {
    appendJsonString(json, _verifiedManifest.target.c_str());
  } else {
    json += "null";
  }
  json += ",\"version\":";
  if (_hasVerifiedPackage) {
    appendJsonString(json, _verifiedManifest.version.c_str());
  } else {
    json += "null";
  }
  json += ",\"versionCode\":";
  if (_hasVerifiedPackage) {
    json += String(_verifiedManifest.versionCode);
  } else {
    json += "null";
  }
  json += ",\"revision\":";
  if (_hasVerifiedPackage) {
    json += String(_verifiedManifest.revision);
  } else {
    json += "null";
  }
  json += ",\"minEsp32UpdateContract\":";
  if (_hasVerifiedPackage) {
    json += String(_verifiedManifest.minEsp32UpdateContract);
  } else {
    json += "null";
  }
  json += ",\"releaseTag\":";
  if (_hasVerifiedPackage) {
    appendJsonString(json, _verifiedManifest.releaseTag.c_str());
  } else {
    json += "null";
  }
  json += ",\"buildProfile\":";
  if (_hasVerifiedPackage) {
    appendJsonString(json, _verifiedManifest.buildProfile.c_str());
  } else {
    json += "null";
  }
  json += ",\"rdpPolicy\":";
  if (_hasVerifiedPackage) {
    appendJsonString(json, _verifiedManifest.rdpPolicy.c_str());
  } else {
    json += "null";
  }
  json += ",\"payloadBytes\":";
  json += String((uint32_t)_packagePayloadBytes);
  json += ",\"firmwareBytes\":";
  json += String((uint32_t)_packageFirmwareBytes);
  json += ",\"antiRollback\":";
  if (_hasVerifiedPackage) {
    json += String(_verifiedManifest.antiRollback);
  } else {
    json += "null";
  }
  json += ",\"antiRollbackFloor\":";
  json += String(_antiRollbackFloor);
  json += ",\"currentFirmwareVersionRaw\":";
  if (_hasCurrentFirmwareVersion) {
    json += String(_currentFirmwareVersionRaw);
  } else {
    json += "null";
  }
  json += ",\"currentFirmwareVersionFloor\":";
  json += String(_currentFirmwareVersionFloor);
  json += ",\"currentFirmwareRevisionRaw\":";
  json += String(_currentFirmwareRevisionRaw);
  json += ",\"postWriteVersionCheckComplete\":";
  json += _postWriteVersionCheckComplete ? "true" : "false";
  json += ",\"postWriteVersionRead\":";
  json += _postWriteVersionRead ? "true" : "false";
  json += ",\"postWriteVersionMatchesPackage\":";
  json += _postWriteVersionMatchesPackage ? "true" : "false";
  json += ",\"postWriteVersionCheckAttempts\":";
  json += String(_postWriteVersionCheckAttempts);
  json += ",\"effectiveAntiRollbackFloor\":";
  json += String(getEffectiveAntiRollbackFloor());
  json += ",\"bootloaderSyncOk\":";
  if (_hasBootloaderSyncResult) {
    json += _lastBootloaderSyncOk ? "true" : "false";
  } else {
    json += "null";
  }
  json += ",\"bootloaderSyncAttempts\":";
  json += String(_lastBootloaderSyncAttempts);
  json += ",\"bootloaderSyncResponse\":";
  json += String(_lastBootloaderSyncResponse);
  json += ",\"bootloaderSyncError\":";
  if (_lastBootloaderSyncError[0] == '\0') {
    json += "null";
  } else {
    appendJsonString(json, _lastBootloaderSyncError);
  }
  json += ",\"bootloaderSessionActive\":";
  json += _bootloaderSessionActive ? "true" : "false";
  json += ",\"writeStartPending\":";
  json += _writeStartPending ? "true" : "false";
  json += ",\"writerStackMinFreeBytes\":";
  if (_writeTaskStackMinFreeBytes == UINT32_MAX) {
    json += "null";
  } else {
    json += String(_writeTaskStackMinFreeBytes);
  }
  json += ",\"espResetReason\":";
  json += String(_espResetReason);
  json += ",\"espResetReasonName\":";
  appendJsonString(json, getEspResetReasonString());
  json += ",\"espBootCount\":";
  json += String(_espBootCount);
  json += ",\"recoveryReason\":";
  if (_phase != UpdatePhase::RecoveryRequired) {
    json += "null";
  } else if (_recoveryRestartUnknown) {
    appendJsonString(json, "restart_unknown");
  } else {
    appendJsonString(json, "write_failed");
  }
  json += ",\"recoveryStage\":";
  if (_phase == UpdatePhase::RecoveryRequired) {
    appendJsonString(json, getRecoveryStageString());
  } else {
    json += "null";
  }
  json += ",\"error\":";
  if (_lastError[0] == '\0') {
    json += "null";
  } else {
    appendJsonString(json, _lastError);
  }
  json += ",\"errorCode\":";
  const char* errorCode = errorCodeForMessage(_lastError);
  if (errorCode == nullptr) {
    json += "null";
  } else {
    appendJsonString(json, errorCode);
  }
  json += "}";
  return json;
}

void Stm32UpdateManager::clearVerifiedPackage() {
  _hasVerifiedPackage = false;
  _packageVerifiedBytes = 0;
  _packageFileBytes = 0;
  _packagePayloadBytes = 0;
  _packageFirmwareBytes = 0;
  _packageChunkTableOffset = 0;
  _packagePayloadOffset = 0;
  _verifiedManifest = PackageManifest();
}

void Stm32UpdateManager::clearWriteContext() {
  _writeContext = WriteContext();
}

bool Stm32UpdateManager::captureWriteContext() {
  if (!_hasVerifiedPackage || _scratchBytes == 0 || _packageFirmwareBytes == 0) {
    clearWriteContext();
    return false;
  }
  _writeContext.manifest = _verifiedManifest;
  _writeContext.scratchBytes = _scratchBytes;
  _writeContext.firmwareBytes = _packageFirmwareBytes;
  _writeContext.payloadBytes = _packagePayloadBytes;
  _writeContext.chunkTableOffset = _packageChunkTableOffset;
  _writeContext.payloadOffset = _packagePayloadOffset;
  memcpy(_writeContext.packageSha256,
         _packageSha256,
         sizeof(_writeContext.packageSha256));
  _writeContext.valid = true;
  return true;
}

bool Stm32UpdateManager::isWriteInProgress() const {
  return _bootloaderSessionActive ||
         _writeTaskHandle != nullptr ||
         updatePhaseHasActiveWriter(_phase);
}

void Stm32UpdateManager::clearBootloaderSyncResult() {
  _hasBootloaderSyncResult = false;
  _lastBootloaderSyncOk = false;
  _lastBootloaderSyncAttempts = 0;
  _lastBootloaderSyncResponse = 0;
  memset(_lastBootloaderSyncError, 0, sizeof(_lastBootloaderSyncError));
}

void Stm32UpdateManager::resetUploadHashState() {
  if (_uploadSha256Active) {
    mbedtls_sha256_free(&_uploadSha256);
    mbedtls_sha256_init(&_uploadSha256);
    _uploadSha256Active = false;
  }
  memset(_packageSha256, 0, sizeof(_packageSha256));
  memset(_expectedPackageSha256Hex, 0, sizeof(_expectedPackageSha256Hex));
  _hasExpectedPackageSha256 = false;
}

