strvsn/ulsa-evo-esp32-firmware/src/stm32_update/stm32_update_manager.cpp
bool Stm32UpdateManager::startUploadHash() {
  mbedtls_sha256_free(&_uploadSha256);
  mbedtls_sha256_init(&_uploadSha256);
  if (mbedtls_sha256_starts_ret(&_uploadSha256, 0) != 0) {
    return false;
  }
  _uploadSha256Active = true;
  return true;
}

bool Stm32UpdateManager::finishUploadHash() {
  if (!_uploadSha256Active) {
    abortPackageUpload("Failed to finish STM32 package sha256");
    return false;
  }
  if (mbedtls_sha256_finish_ret(&_uploadSha256, _packageSha256) != 0) {
    abortPackageUpload("Failed to finish STM32 package sha256");
    return false;
  }
  mbedtls_sha256_free(&_uploadSha256);
  mbedtls_sha256_init(&_uploadSha256);
  _uploadSha256Active = false;
  if (_hasExpectedPackageSha256 &&
      !digestMatchesHex(_packageSha256, _expectedPackageSha256Hex)) {
    abortPackageUpload("STM32 package sha256 mismatch");
    return false;
  }
  return true;
}

bool Stm32UpdateManager::calculateStoredPackageSha256() {
  resetUploadHashState();
  if (!startUploadHash()) {
    abortPackageUpload("Failed to start STM32 package sha256");
    return false;
  }

  uint8_t buffer[1024];
  size_t offset = 0;
  while (offset < _scratchBytes) {
    const size_t remaining = _scratchBytes - offset;
    const size_t length = remaining < sizeof(buffer) ? remaining : sizeof(buffer);
    if (esp_partition_read(_partition, offset, buffer, length) != ESP_OK) {
      abortPackageUpload("Failed to read stored STM32 package for sha256");
      return false;
    }
    if (mbedtls_sha256_update_ret(&_uploadSha256, buffer, length) != 0) {
      abortPackageUpload("Failed to update STM32 package sha256");
      return false;
    }
    offset += length;
  }
  return finishUploadHash();
}

void Stm32UpdateManager::setBootloaderSyncError(const char* error) {
  if (error == nullptr) {
    memset(_lastBootloaderSyncError, 0, sizeof(_lastBootloaderSyncError));
    return;
  }
  strncpy(_lastBootloaderSyncError, error, sizeof(_lastBootloaderSyncError) - 1);
  _lastBootloaderSyncError[sizeof(_lastBootloaderSyncError) - 1] = '\0';
}

bool Stm32UpdateManager::restoreStoredPackageIfPresent() {
  if (_partition == nullptr) {
    return false;
  }

  size_t packageLength = 0;
  const PackageError lengthError =
    readPackageLengthFromPartition(_partition, _partition->size, packageLength);
  if (lengthError == PackageError::BadMagic || lengthError == PackageError::TooSmall) {
    return false;
  }
  if (lengthError != PackageError::Ok) {
    setError(packageErrorToString(lengthError));
    _phase = UpdatePhase::Error;
    return false;
  }

  _scratchBytes = packageLength;
  _totalBytesHint = packageLength;
  _writtenBytes = 0;
  _verifiedBytes = 0;
  _packageVerifiedBytes = 0;
  _packagePayloadBytes = 0;
  _packageFirmwareBytes = 0;
  _packageChunkTableOffset = 0;
  _packagePayloadOffset = 0;
  _phase = UpdatePhase::PackageStored;
  if (!calculateStoredPackageSha256()) {
    return false;
  }
  if (!verifyStoredPackage(true)) {
    return false;
  }

  const WriteRecoveryStage persistedStage = loadWriteRecoveryMarker();
  _recoveryStage = persistedStage == WriteRecoveryStage::None
    ? WriteRecoveryStage::PackageVerified
    : persistedStage;
  _recoveryRestartUnknown = true;
  _writeStartPending = false;
  _bootloaderSessionActive = false;
  _writtenBytes = 0;
  _verifiedBytes = 0;
  clearBootloaderSyncResult();
  setError("STM32 restart left update state unknown");
  _phase = UpdatePhase::RecoveryRequired;
  return true;
}

uint32_t Stm32UpdateManager::getEffectiveAntiRollbackFloor() const {
  return _currentFirmwareVersionFloor > _antiRollbackFloor
    ? _currentFirmwareVersionFloor
    : _antiRollbackFloor;
}

void Stm32UpdateManager::refreshCurrentFirmwareVersionFloor() {
  _hasCurrentFirmwareVersion = false;
  _currentFirmwareVersionRaw = 0;
  _currentFirmwareRevisionRaw = 0;
  _currentFirmwareVersionFloor = 0;
  if (_i2cClient == nullptr) {
    return;
  }

  uint32_t firmwareVersion = 0;
  if (!_i2cClient->readFirmwareVersion(firmwareVersion)) {
    return;
  }
  Stm32SemanticVersion semanticVersion = {};
  if (decodeStm32VersionCode(firmwareVersion, semanticVersion)) {
    _currentFirmwareVersionRaw = firmwareVersion;
    uint32_t firmwareRevision = 0;
    if (_i2cClient->readFirmwareRevision(firmwareRevision) &&
        firmwareRevision >= STM32_MIN_REVISION) {
      _hasCurrentFirmwareVersion = true;
      _currentFirmwareRevisionRaw = firmwareRevision;
      _currentFirmwareVersionFloor = firmwareRevision;
      return;
    }

    // A tagged versionCode without a positive revision violates register contract 0x0B.
    // Block every update rather than falling back to an empty NVS floor.
    _currentFirmwareVersionFloor = 0xFFFFFFFFUL;
  }
}

void Stm32UpdateManager::resetPostWriteVersionCheck() {
  _postWriteVersionCheckAttempts = 0;
  _postWriteVersionCheckComplete = false;
  _postWriteVersionRead = false;
  _postWriteVersionMatchesPackage = false;
}

bool Stm32UpdateManager::loadAntiRollbackFloor() {
  Preferences prefs;
  if (!prefs.begin(STM32_UPDATE_NVS_NAMESPACE, true)) {
    _antiRollbackStoreReady = false;
    _antiRollbackFloor = 0;
    return false;
  }

  _antiRollbackFloor = prefs.getUInt(STM32_UPDATE_NVS_ANTI_ROLLBACK_KEY, 0);
  prefs.end();
  _antiRollbackStoreReady = true;
  return true;
}

bool Stm32UpdateManager::saveAntiRollbackFloor(uint32_t antiRollback) {
  Preferences prefs;
  if (!prefs.begin(STM32_UPDATE_NVS_NAMESPACE, false)) {
    _antiRollbackStoreReady = false;
    return false;
  }

  const size_t written = prefs.putUInt(STM32_UPDATE_NVS_ANTI_ROLLBACK_KEY, antiRollback);
  prefs.end();
  if (written == 0) {
    _antiRollbackStoreReady = false;
    return false;
  }

  _antiRollbackFloor = antiRollback;
  _antiRollbackStoreReady = true;
  return true;
}

bool Stm32UpdateManager::saveWriteRecoveryMarker(WriteRecoveryStage stage) {
  if (stage != WriteRecoveryStage::None && !_hasVerifiedPackage) {
    return false;
  }
  Preferences prefs;
  if (!prefs.begin(STM32_UPDATE_NVS_NAMESPACE, false)) {
    return false;
  }
  bool saved = true;
  if (stage != WriteRecoveryStage::None) {
    saved = prefs.putBytes(
      STM32_UPDATE_NVS_WRITE_SHA_KEY,
      _packageSha256,
      sizeof(_packageSha256)) == sizeof(_packageSha256);
  }
  if (saved) {
    saved = prefs.putUChar(
      STM32_UPDATE_NVS_WRITE_STAGE_KEY,
      static_cast<uint8_t>(stage)) == sizeof(uint8_t);
  }
  prefs.end();
  if (saved) {
    _recoveryStage = stage;
    _recoveryRestartUnknown = false;
  }
  return saved;
}

WriteRecoveryStage Stm32UpdateManager::loadWriteRecoveryMarker() const {
  Preferences prefs;
  if (!prefs.begin(STM32_UPDATE_NVS_NAMESPACE, true)) {
    return WriteRecoveryStage::None;
  }
  const uint8_t raw = prefs.getUChar(STM32_UPDATE_NVS_WRITE_STAGE_KEY, 0);
  uint8_t packageSha256[STM32_PACKAGE_SHA256_SIZE] = {};
  const size_t shaLength = prefs.getBytesLength(STM32_UPDATE_NVS_WRITE_SHA_KEY);
  const size_t shaRead = shaLength == sizeof(packageSha256)
    ? prefs.getBytes(STM32_UPDATE_NVS_WRITE_SHA_KEY,
                     packageSha256,
                     sizeof(packageSha256))
    : 0;
  prefs.end();
  if (!isValidWriteRecoveryStage(raw) || raw == 0 ||
      shaRead != sizeof(packageSha256) ||
      memcmp(packageSha256, _packageSha256, sizeof(packageSha256)) != 0) {
    return WriteRecoveryStage::None;
  }
  return static_cast<WriteRecoveryStage>(raw);
}

const char* Stm32UpdateManager::getRecoveryStageString() const {
  switch (_recoveryStage) {
    case WriteRecoveryStage::PackageVerified: return "package_verified";
    case WriteRecoveryStage::WriteScheduled: return "write_scheduled";
    case WriteRecoveryStage::WriterStarting: return "writer_starting";
    case WriteRecoveryStage::DestructiveCommandSent: return "destructive_command_sent";
    case WriteRecoveryStage::FirmwareTransferred: return "firmware_transferred";
    case WriteRecoveryStage::RestartConfirming: return "restart_confirming";
    case WriteRecoveryStage::None:
    default: return "none";
  }
}

void Stm32UpdateManager::captureEspBootDiagnostics() {
  _espResetReason = static_cast<uint32_t>(esp_reset_reason());
  Preferences prefs;
  if (!prefs.begin(STM32_UPDATE_NVS_NAMESPACE, false)) {
    _espBootCount = 0;
    return;
  }
  const uint32_t previous = prefs.getUInt(STM32_UPDATE_NVS_BOOT_COUNT_KEY, 0);
  _espBootCount = previous == UINT32_MAX ? UINT32_MAX : previous + 1U;
  if (prefs.putUInt(STM32_UPDATE_NVS_BOOT_COUNT_KEY, _espBootCount) !=
      sizeof(_espBootCount)) {
    _espBootCount = 0;
  }
  prefs.end();
}

const char* Stm32UpdateManager::getEspResetReasonString() const {
  switch (static_cast<esp_reset_reason_t>(_espResetReason)) {
    case ESP_RST_POWERON: return "power_on";
    case ESP_RST_EXT: return "external";
    case ESP_RST_SW: return "software";
    case ESP_RST_PANIC: return "panic";
    case ESP_RST_INT_WDT: return "interrupt_watchdog";
    case ESP_RST_TASK_WDT: return "task_watchdog";
    case ESP_RST_WDT: return "watchdog";
    case ESP_RST_DEEPSLEEP: return "deep_sleep";
    case ESP_RST_BROWNOUT: return "brownout";
    case ESP_RST_SDIO: return "sdio";
    case ESP_RST_UNKNOWN:
    default: return "unknown";
  }
}

void Stm32UpdateManager::recordWriteTaskStackWatermark() {
  const uint32_t freeBytes = static_cast<uint32_t>(
    uxTaskGetStackHighWaterMark(nullptr));
  if (freeBytes < _writeTaskStackMinFreeBytes) {
    _writeTaskStackMinFreeBytes = freeBytes;
  }
}

bool Stm32UpdateManager::writeTaskHasSafeStackHeadroom() {
  recordWriteTaskStackWatermark();
  return _writeTaskStackMinFreeBytes >= STM32_WRITE_STACK_MIN_FREE_BYTES;
}

void Stm32UpdateManager::clearError() {
  memset(_lastError, 0, sizeof(_lastError));
}

void Stm32UpdateManager::setError(const char* error) {
  if (error == nullptr) {
    clearError();
    return;
  }
  strncpy(_lastError, error, sizeof(_lastError) - 1);
  _lastError[sizeof(_lastError) - 1] = '\0';
}

const char* Stm32UpdateManager::getPhaseString() const {
  switch (_phase) {
    case UpdatePhase::Idle: return "idle";
    case UpdatePhase::Receiving: return "receiving";
    case UpdatePhase::PackageStored: return "package_stored";
    case UpdatePhase::Verifying: return "verifying";
    case UpdatePhase::ReadyToWrite: return "ready_to_write";
    case UpdatePhase::Writing: return "writing";
    case UpdatePhase::VerifyingFlash: return "verifying_flash";
    case UpdatePhase::Restarting: return "restarting";
    case UpdatePhase::Complete: return "complete";
    case UpdatePhase::Error: return "error";
    case UpdatePhase::RecoveryRequired: return "recovery_required";
    default: return "error";
  }
}

}  // namespace stm32_update
